var Type = require("./Type");

function Integer(number){
    number = parseInt(number);
    if (isNaN(number)) return 0;
    return number;
}

Integer.prototype.add = function (x){
    this.val(this.val() + x);
    return this;
}
Integer.prototype.sub = function (x){
    this.val(this.val() - x);
    return this;
}
Integer.prototype.div = function (x){
    this.val(this.val() / x);
    return this;
}
Integer.prototype.mul = function (x){
    this.val(this.val() * x);
    return this;
}
Integer.prototype.mod = function (x){
    this.val(this.val() % x);
    return this;
}
Integer.prototype.toFixed = function (x){
    return this.val().toFixed(x);
}


function Float(number){
    number = parseFloat(number);
    if (isNaN(number)) return 0;
    return number;
}
Float.prototype.add = function (x){
    this.val(this.val() + x);
    return this;
}
Float.prototype.sub = function (x){
    this.val(this.val() - x);
    return this;
}
Float.prototype.div = function (x){
    this.val(this.val() / x);
    return this;
}
Float.prototype.mul = function (x){
    this.val(this.val() * x);
    return this;
}
Float.prototype.mod = function (x){
    this.val(this.val() % x);
    return this;
}
Float.prototype.toFixed = function (x){
    return this.val().toFixed(x);
}


function _String(s){
    return String(s);
}
["indexOf","match","replace","search","slice","split","substr","substring","toLowerCase","toUpperCase","charAt","charCodeAt","concat","trim"].forEach(function (name){
    _String.prototype[name] = function (){
        return String.prototype[name].apply(this.val(),arguments);
    }
});


function Time(time){
    var now = +new Date;
    if (time == undefined) return now;
    time = +new Date(time);
    if (isNaN(time)) return now;
    return time;
}
function leftPad(str,padding,length){
    str = '' + str;
    if (str.length >= length){
        return str;
    }
    for (var i=str.length;i<length;i++){
        str = padding + str;
    }
    return str;
}

Time.prototype.date = function (){
    return new Date(this.val());
}

Time.prototype.format = function (template){
    var time = new Date(this.val())
    var day = template || "yyyy-MM-dd hh:mm:ss";
    day = day.replace(/(y+)/,function ($,$1){
        return leftPad(time.getFullYear(),0,$1.length)
    });
    day = day.replace(/(M+)/,function ($,$1){
        return leftPad(time.getMonth() + 1,0,$1.length)
    });
    day = day.replace(/(d+)/,function ($,$1){
        return leftPad(time.getDate(),0,$1.length)
    });
    day = day.replace(/(h+)/,function ($,$1){
        return leftPad(time.getHours(),0,$1.length)
    });
    day = day.replace(/(m+)/,function ($,$1){
        return leftPad(time.getMinutes(),0,$1.length)
    });
    day = day.replace(/(s+)/,function ($,$1){
        return leftPad(time.getSeconds(),0,$1.length)
    });
    return day;
}

Time.prototype.toString = function (){
    return this.date().toString();
}



function isBase64(str){
    if (!str) return false;
    var len = str.length;
    if (!len || len % 4 !== 0 || /[^A-Z0-9+\/=]/i.test(str)){
        return false;
    }
    var firstPaddingChar = str.indexOf('=');
    return firstPaddingChar === -1 || firstPaddingChar === len - 1 || firstPaddingChar === len - 2 && str[len - 1] === '=';
}

function Base64(buffer){
    if (Buffer.isBuffer(buffer)){
        return new Buffer(buffer).toString("base64");
    }
    if (typeof buffer == "string"){
        if (/http/i.test(buffer)){
            return buffer;
        }else if (isBase64(buffer)){
            return buffer;
        }else {
            return new Buffer(buffer).toString("base64");
        }
    }
    return "";
}

Base64.prototype.toBuffer = function (){
    return new Buffer(this.val(),"base64");
}


var crypto = require('crypto');

function UUID(input){
    if (input.match(/[0-9a-z]{8}-[0-9a-z]{4}-[0-9a-z]{4}-[0-9a-z]{4}-[0-9a-z]{12}/)){
        return input;
    }
    var hash = crypto.createHash("sha256").update(input,'utf8').digest("hex");
    var lens = [8,4,4,4,12];
    var array = [],offset=0;
    lens.forEach(function (len){
        array.push(hash.substring(offset,offset+len));
        offset += len;
    });
    return array.join("-");
}


function Id(string){
    string = string.replace(/\/$/,'').split('/').pop().replace(/\W/g,"");
    return leftPad(string,'0',5);
}


function IsEnd(value){
    if (value == undefined){
        return false;
    }else if (typeof value == "boolean"){
        return value;
    }else if (typeof value == "number"){
        return value > 0;
    }else if (typeof value == "string"){
        return /完成|完结|完本|终章|结局|全本|结束|结尾|末尾|末章/.test(value);
    }
    return false;
}


function Link(object){
    if (object == undefined) return '';
    if (typeof object === "string") return object;
    if (Array.isArray(object)){
        return object.map(arguments.callee).join('|');
    }
    object.method = (object.method || 'GET').toUpperCase();
    object.url = object.url || object.href || object.src;
    if (object.method == 'GET') return object.url;
    return JSON.stringify(object);
}

Link.prototype.toString = function (){
    var link = this.val();
    if (Array.isArray(link)){
        link = link.filter(x=>x.url);
        return JSON.stringify(this.val());
    }
    if (!link.url) return '';
    if (link.method == 'GET') return link.url;
    return JSON.stringify(link);
}


function toReStr(str) {
    return str.replace(/[()\[\]{}|+.,^$?\\*]/g, "\\$&");
}

var toString = Object.prototype.toString;
function isRegExp(value){
    return toString.call(value) === "[object RegExp]"
}

function isObject(value){
    return toString.call(value) === "[object Object]"
}

function isFunction(value){
    return toString.call(value) === "[object Function]"
}

function isString(value){
    return toString.call(value) === "[object String]"
}
function replace(value,selector){
    if (!value) return value;
    if (isFunction(selector)){
        value = selector(value);
        return value;
    }
    if (isString(selector)){
        try{
            var regexp = new RegExp(selector,"gi");
        }catch (e){
            var regexp = new RegExp(toReStr(selector),"gi");
        }
        return replace(value,regexp);
    }
    if (Array.isArray(selector)){
        selector.forEach(x=>{
            value = replace(value,x);
        });
        return value;
    }
    if (isRegExp(selector)){
        value = value.replace(selector,"");
        return value;
    }
    if (isObject(selector)){
        Object.keys(selector).forEach(function (k){
            try{
                var regexp = new RegExp(k,"gi");
            }catch (e){
                var regexp = new RegExp(toReStr(k),"gi");
            }
            value = value.replace(regexp,selector[k]);
        });
        return value;
    }
    return value;
};

function HTMLdecode(text){
    text = text.replace(/&#(x)?([^&]{1,5});?/ig,function($, $1, $2){
        return String.fromCharCode(parseInt($2, $1 ? 16 : 10));
    });
    return replace(text,{"&nbsp;":" ","&(amp;)+":"&","&lt;":"<","&gt;":">","&hellip;":"…","&quot;":"\"","&apos;":"'","&lsquo;":"‘","&rsquo;":"’","&ldquo;":"“","&rdquo;":"”","&acute;":"´","&copy;":"©","&deg;":"°","&raquo;":"»","&brvbar;":"¦","&yen;":"¥","&bdquo;":"„","&middot;":"·","&rsaquo;":"›","&mdash;":"—","&ordm;":"º","&lsaquo;":"‹","&ndash;":"–","&sbquo;":"‚","&ge;":"≥","&le;":"≤","&prime;":"′"});
}


function TrimText(text){
    text = text.replace(/\x00/g,'');
    text = text.replace(/\u3000/g,'  ');
    text = text.replace(/\u0020/g,' ');
    text = text.replace(/\u00A0/g,' ');
    return text.trim();
}


function SimpleChinese(text){
    var dict = {"獃":"呆","畫":"画","豔":"艳","嚐":"尝","醜":"丑","儘":"尽","週":"周","澱":"淀","範":"范","豐":"丰","後":"后","夥":"伙","薑":"姜","簾":"帘","餘":"馀","鬱":"郁","願":"愿","雲":"云","築":"筑","準":"准","廠":"厂","廣":"广","闢":"辟","別":"别","沖":"冲","種":"种","蟲":"虫","擔":"担","黨":"党","鬥":"斗","兒":"儿","櫃":"柜","劃":"划","壞":"坏","幾":"几","價":"价","據":"据","捲":"卷","適":"适","蠟":"蜡","臘":"腊","麽":"么","萬":"万","寧":"宁","樸":"朴","蘋":"苹","僕":"仆","確":"确","勝":"胜","術":"术","體":"体","塗":"涂","葉":"叶","傭":"佣","與":"与","徵":"征","惡":"恶","發":"发","復":"复","匯":"汇","獲":"获","飢":"饥","盡":"尽","歷":"历","滷":"卤","彌":"弥","簽":"签","纖":"纤","蘇":"苏","壇":"坛","團":"团","須":"须","臟":"脏","鐘":"钟","藥":"药","當":"当","弔":"吊","蘊":"蕴","線":"线","為":"为","產":"产","眾":"众","偽":"伪","鳧":"凫","廁":"厕","啟":"启","牆":"墙","殼":"壳","獎":"奖","媯":"妫","並":"并","錄":"录","愨":"悫","極":"极","溈":"沩","瘺":"瘘","鹼":"碱","豎":"竖","絕":"绝","繡":"绣","絛":"绦","緔":"绱","綳":"绷","綠":"绿","韁":"缰","苎":"苧","蒓":"莼","說":"说","謠":"谣","譾":"谫","贓":"赃","齎":"赍","贗":"赝","醞":"酝","採":"采","鉤":"钩","缽":"钵","銹":"锈","銳":"锐","杴":"锨","鐫":"镌","钁":"镢","閱":"阅","頹":"颓","顏":"颜","罵":"骂","鯰":"鲶","鯗":"鲞","鱷":"鳄","雞":"鸡","鶿":"鹚","盪":"荡","錘":"锤","㠏":"㟆","專":"专","業":"业","叢":"丛","東":"东","絲":"丝","丟":"丢","兩":"两","嚴":"严","喪":"丧","個":"个","臨":"临","麗":"丽","舉":"举","義":"义","烏":"乌","樂":"乐","喬":"乔","習":"习","鄉":"乡","書":"书","買":"买","亂":"乱","爭":"争","於":"于","虧":"亏","亞":"亚","畝":"亩","親":"亲","褻":"亵","嚲":"亸","億":"亿","僅":"仅","從":"从","侖":"仑","倉":"仓","儀":"仪","們":"们","優":"优","會":"会","傴":"伛","傘":"伞","偉":"伟","傳":"传","俔":"伣","傷":"伤","倀":"伥","倫":"伦","傖":"伧","佇":"伫","僉":"佥","俠":"侠","侶":"侣","僥":"侥","偵":"侦","側":"侧","僑":"侨","儈":"侩","儕":"侪","儂":"侬","俁":"俣","儔":"俦","儼":"俨","倆":"俩","儷":"俪","倈":"俫","儉":"俭","債":"债","傾":"倾","傯":"偬","僂":"偻","僨":"偾","償":"偿","儻":"傥","儐":"傧","儲":"储","儺":"傩","儸":"㑩","兌":"兑","兗":"兖","蘭":"兰","關":"关","興":"兴","茲":"兹","養":"养","獸":"兽","囅":"冁","內":"内","岡":"冈","冊":"册","寫":"写","軍":"军","農":"农","馮":"冯","決":"决","況":"况","凍":"冻","凈":"净","涼":"凉","減":"减","湊":"凑","凜":"凛","鳳":"凤","憑":"凭","凱":"凯","擊":"击","鑿":"凿","芻":"刍","劉":"刘","則":"则","剛":"刚","創":"创","刪":"删","剗":"刬","剄":"刭","剎":"刹","劊":"刽","劌":"刿","剴":"剀","劑":"剂","剮":"剐","劍":"剑","剝":"剥","劇":"剧","劏":"㓥","劚":"㔉","勸":"劝","辦":"办","務":"务","勱":"劢","動":"动","勵":"励","勁":"劲","勞":"劳","勢":"势","勛":"勋","勩":"勚","勻":"匀","匭":"匦","匱":"匮","區":"区","醫":"医","華":"华","協":"协","單":"单","賣":"卖","盧":"卢","衛":"卫","卻":"却","廳":"厅","厲":"厉","壓":"压","厭":"厌","厙":"厍","龎":"厐","釐":"厘","廂":"厢","厴":"厣","廈":"厦","廚":"厨","廄":"厩","廝":"厮","縣":"县","叄":"叁","參":"参","雙":"双","變":"变","敘":"叙","疊":"叠","號":"号","嘆":"叹","嘰":"叽","嚇":"吓","呂":"吕","嗎":"吗","唚":"吣","噸":"吨","聽":"听","吳":"吴","吶":"呐","嘸":"呒","囈":"呓","嘔":"呕","嚦":"呖","唄":"呗","員":"员","咼":"呙","嗆":"呛","嗚":"呜","詠":"咏","嚨":"咙","嚀":"咛","噝":"咝","吒":"咤","響":"响","啞":"哑","噠":"哒","嘵":"哓","嗶":"哔","噦":"哕","嘩":"哗","噲":"哙","嚌":"哜","噥":"哝","喲":"哟","嘜":"唛","嗊":"唝","嘮":"唠","啢":"唡","嗩":"唢","喚":"唤","嘖":"啧","嗇":"啬","囀":"啭","嚙":"啮","嘽":"啴","嘯":"啸","喎":"㖞","噴":"喷","嘍":"喽","嚳":"喾","囁":"嗫","噯":"嗳","噓":"嘘","嚶":"嘤","囑":"嘱","噚":"㖊","嚕":"噜","囂":"嚣","園":"园","囪":"囱","圍":"围","圇":"囵","國":"国","圖":"图","圓":"圆","聖":"圣","壙":"圹","場":"场","阪":"坂","塊":"块","堅":"坚","壢":"坜","壩":"坝","塢":"坞","墳":"坟","墜":"坠","壟":"垄","壠":"垅","壚":"垆","壘":"垒","墾":"垦","堊":"垩","墊":"垫","埡":"垭","壋":"垱","塏":"垲","堖":"垴","塒":"埘","塤":"埙","堝":"埚","垵":"埯","塹":"堑","墮":"堕","壯":"壮","聲":"声","壺":"壶","壼":"壸","處":"处","備":"备","夠":"够","頭":"头","誇":"夸","夾":"夹","奪":"夺","奩":"奁","奐":"奂","奮":"奋","奧":"奥","姦":"奸","妝":"妆","婦":"妇","媽":"妈","嫵":"妩","嫗":"妪","姍":"姗","奼":"姹","婁":"娄","婭":"娅","嬈":"娆","嬌":"娇","孌":"娈","娛":"娱","媧":"娲","嫻":"娴","嫿":"婳","嬰":"婴","嬋":"婵","嬸":"婶","媼":"媪","嬡":"嫒","嬪":"嫔","嬙":"嫱","嬤":"嬷","孫":"孙","學":"学","孿":"孪","寶":"宝","實":"实","寵":"宠","審":"审","憲":"宪","宮":"宫","寬":"宽","賓":"宾","寢":"寝","對":"对","尋":"寻","導":"导","壽":"寿","將":"将","爾":"尔","塵":"尘","嘗":"尝","堯":"尧","尷":"尴","屍":"尸","層":"层","屓":"屃","屜":"屉","屆":"届","屬":"属","屢":"屡","屨":"屦","嶼":"屿","歲":"岁","豈":"岂","嶇":"岖","崗":"岗","峴":"岘","嶴":"岙","嵐":"岚","島":"岛","嶺":"岭","崬":"岽","巋":"岿","嶧":"峄","峽":"峡","嶢":"峣","嶠":"峤","崢":"峥","巒":"峦","嶗":"崂","崍":"崃","嶮":"崄","嶄":"崭","嶸":"嵘","嶔":"嵚","嶁":"嵝","巔":"巅","鞏":"巩","巰":"巯","幣":"币","帥":"帅","師":"师","幃":"帏","帳":"帐","幟":"帜","帶":"带","幀":"帧","幫":"帮","幬":"帱","幘":"帻","幗":"帼","冪":"幂","莊":"庄","慶":"庆","廬":"庐","廡":"庑","庫":"库","應":"应","廟":"庙","龐":"庞","廢":"废","廩":"廪","開":"开","異":"异","棄":"弃","弒":"弑","張":"张","弳":"弪","彎":"弯","彈":"弹","強":"强","歸":"归","彞":"彝","彥":"彦","徹":"彻","徑":"径","徠":"徕","憶":"忆","懺":"忏","憂":"忧","愾":"忾","懷":"怀","態":"态","慫":"怂","憮":"怃","慪":"怄","悵":"怅","愴":"怆","憐":"怜","總":"总","懟":"怼","懌":"怿","戀":"恋","恆":"恒","懇":"恳","慟":"恸","懨":"恹","愷":"恺","惻":"恻","惱":"恼","惲":"恽","悅":"悦","懸":"悬","慳":"悭","悞":"悮","憫":"悯","驚":"惊","懼":"惧","慘":"惨","懲":"惩","憊":"惫","愜":"惬","慚":"惭","憚":"惮","慣":"惯","慍":"愠","憤":"愤","憒":"愦","懾":"慑","懣":"懑","懶":"懒","懍":"懔","戇":"戆","戔":"戋","戲":"戏","戧":"戗","戰":"战","戩":"戬","戱":"戯","戶":"户","撲":"扑","執":"执","擴":"扩","捫":"扪","掃":"扫","揚":"扬","擾":"扰","撫":"抚","拋":"抛","摶":"抟","摳":"抠","掄":"抡","搶":"抢","護":"护","報":"报","擬":"拟","攏":"拢","揀":"拣","擁":"拥","攔":"拦","擰":"拧","撥":"拨","擇":"择","掛":"挂","摯":"挚","攣":"挛","掗":"挜","撾":"挝","撻":"挞","挾":"挟","撓":"挠","擋":"挡","撟":"挢","掙":"挣","擠":"挤","揮":"挥","撏":"挦","輓":"挽","挩":"捝","撈":"捞","損":"损","撿":"捡","換":"换","搗":"捣","擄":"掳","摑":"掴","擲":"掷","撣":"掸","摻":"掺","摜":"掼","攬":"揽","搵":"揾","撳":"揿","攙":"搀","擱":"搁","摟":"搂","攪":"搅","攜":"携","攝":"摄","攄":"摅","擺":"摆","搖":"摇","擯":"摈","攤":"摊","攖":"撄","撐":"撑","撝":"㧑","攆":"撵","擷":"撷","擼":"撸","攛":"撺","擓":"㧟","擻":"擞","攢":"攒","敵":"敌","斂":"敛","數":"数","齋":"斋","斕":"斓","斬":"斩","斷":"断","無":"无","舊":"旧","時":"时","曠":"旷","暘":"旸","曇":"昙","晝":"昼","曨":"昽","顯":"显","晉":"晋","曬":"晒","曉":"晓","曄":"晔","暈":"晕","暉":"晖","暫":"暂","曖":"暧","機":"机","殺":"杀","雜":"杂","權":"权","桿":"杆","條":"条","來":"来","楊":"杨","榪":"杩","傑":"杰","構":"构","樅":"枞","樞":"枢","棗":"枣","櫪":"枥","梘":"枧","棖":"枨","槍":"枪","楓":"枫","梟":"枭","檸":"柠","檉":"柽","梔":"栀","柵":"栅","標":"标","棧":"栈","櫛":"栉","櫳":"栊","棟":"栋","櫨":"栌","櫟":"栎","欄":"栏","樹":"树","棲":"栖","慄":"栗","樣":"样","欒":"栾","椏":"桠","橈":"桡","楨":"桢","檔":"档","榿":"桤","橋":"桥","樺":"桦","檜":"桧","槳":"桨","樁":"桩","夢":"梦","檮":"梼","棶":"梾","槤":"梿","檢":"检","梲":"棁","欞":"棂","槨":"椁","櫝":"椟","槧":"椠","欏":"椤","橢":"椭","樓":"楼","欖":"榄","榲":"榅","櫬":"榇","櫚":"榈","櫸":"榉","檟":"槚","檻":"槛","檳":"槟","櫧":"槠","橫":"横","檣":"樯","櫻":"樱","櫫":"橥","櫥":"橱","櫓":"橹","櫞":"橼","檁":"檩","歡":"欢","歟":"欤","歐":"欧","殲":"歼","歿":"殁","殤":"殇","殘":"残","殞":"殒","殮":"殓","殫":"殚","殯":"殡","殨":"㱮","殰":"㱩","毆":"殴","毀":"毁","轂":"毂","畢":"毕","斃":"毙","氈":"毡","毿":"毵","氌":"氇","氣":"气","氫":"氢","氬":"氩","氳":"氲","漢":"汉","湯":"汤","洶":"汹","溝":"沟","沒":"没","灃":"沣","漚":"沤","瀝":"沥","淪":"沦","滄":"沧","滬":"沪","濘":"泞","註":"注","淚":"泪","澩":"泶","瀧":"泷","瀘":"泸","濼":"泺","瀉":"泻","潑":"泼","澤":"泽","涇":"泾","潔":"洁","灑":"洒","窪":"洼","浹":"浃","淺":"浅","漿":"浆","澆":"浇","湞":"浈","濁":"浊","測":"测","澮":"浍","濟":"济","瀏":"浏","滻":"浐","渾":"浑","滸":"浒","濃":"浓","潯":"浔","濤":"涛","澇":"涝","淶":"涞","漣":"涟","潿":"涠","渦":"涡","渙":"涣","滌":"涤","潤":"润","澗":"涧","漲":"涨","澀":"涩","淵":"渊","淥":"渌","漬":"渍","瀆":"渎","漸":"渐","澠":"渑","漁":"渔","瀋":"渖","滲":"渗","溫":"温","灣":"湾","濕":"湿","潰":"溃","濺":"溅","漵":"溆","潷":"滗","滾":"滚","滯":"滞","灧":"滟","灄":"滠","滿":"满","瀅":"滢","濾":"滤","濫":"滥","灤":"滦","濱":"滨","灘":"滩","澦":"滪","灠":"漤","瀠":"潆","瀟":"潇","瀲":"潋","濰":"潍","潛":"潜","瀦":"潴","瀾":"澜","瀨":"濑","瀕":"濒","瀇":"㲿","灝":"灏","滅":"灭","燈":"灯","靈":"灵","竈":"灶","災":"灾","燦":"灿","煬":"炀","爐":"炉","燉":"炖","煒":"炜","熗":"炝","點":"点","煉":"炼","熾":"炽","爍":"烁","爛":"烂","烴":"烃","燭":"烛","煙":"烟","煩":"烦","燒":"烧","燁":"烨","燴":"烩","燙":"烫","燼":"烬","熱":"热","煥":"焕","燜":"焖","燾":"焘","煱":"㶽","熅":"煴","燶":"㶶","愛":"爱","爺":"爷","牘":"牍","氂":"牦","牽":"牵","犧":"牺","犢":"犊","狀":"状","獷":"犷","獁":"犸","猶":"犹","狽":"狈","獮":"狝","獰":"狞","獨":"独","狹":"狭","獅":"狮","獪":"狯","猙":"狰","獄":"狱","猻":"狲","獫":"猃","獵":"猎","獼":"猕","玀":"猡","豬":"猪","貓":"猫","蝟":"猬","獻":"献","獺":"獭","獱":"㺍","璣":"玑","瑒":"玚","瑪":"玛","瑋":"玮","環":"环","現":"现","瑲":"玱","璽":"玺","琺":"珐","瓏":"珑","璫":"珰","琿":"珲","璉":"琏","瑣":"琐","瓊":"琼","瑤":"瑶","璦":"瑷","瓔":"璎","瓚":"瓒","甌":"瓯","電":"电","暢":"畅","疇":"畴","癤":"疖","療":"疗","瘧":"疟","癘":"疠","瘍":"疡","癧":"疬","瘲":"疭","瘡":"疮","瘋":"疯","皰":"疱","痾":"疴","癰":"痈","痙":"痉","癢":"痒","瘂":"痖","癆":"痨","瘓":"痪","癇":"痫","癉":"瘅","瘮":"瘆","瘞":"瘗","癟":"瘪","癱":"瘫","癮":"瘾","癭":"瘿","癩":"癞","癬":"癣","癲":"癫","皚":"皑","皺":"皱","皸":"皲","盞":"盏","鹽":"盐","監":"监","蓋":"盖","盜":"盗","盤":"盘","瞘":"眍","眥":"眦","矓":"眬","睜":"睁","睞":"睐","瞼":"睑","瞶":"瞆","瞞":"瞒","瞜":"䁖","矚":"瞩","矯":"矫","磯":"矶","礬":"矾","礦":"矿","碭":"砀","碼":"码","磚":"砖","硨":"砗","硯":"砚","碸":"砜","礪":"砺","礱":"砻","礫":"砾","礎":"础","硜":"硁","碩":"硕","硤":"硖","磽":"硗","磑":"硙","礙":"碍","磧":"碛","磣":"碜","禮":"礼","禡":"祃","禕":"祎","禰":"祢","禎":"祯","禱":"祷","禍":"祸","稟":"禀","祿":"禄","禪":"禅","離":"离","禿":"秃","稈":"秆","積":"积","稱":"称","穢":"秽","穠":"秾","穭":"稆","稅":"税","稏":"䅉","穌":"稣","穩":"稳","穡":"穑","窮":"穷","竊":"窃","竅":"窍","窵":"窎","窯":"窑","竄":"窜","窩":"窝","窺":"窥","竇":"窦","窶":"窭","競":"竞","篤":"笃","筍":"笋","筆":"笔","筧":"笕","箋":"笺","籠":"笼","籩":"笾","篳":"筚","篩":"筛","簹":"筜","箏":"筝","筴":"䇲","籌":"筹","篔":"筼","簡":"简","籙":"箓","簀":"箦","篋":"箧","籜":"箨","籮":"箩","簞":"箪","簫":"箫","簣":"篑","簍":"篓","籃":"篮","籬":"篱","籪":"簖","籟":"籁","糴":"籴","類":"类","秈":"籼","糶":"粜","糲":"粝","粵":"粤","糞":"粪","糧":"粮","糝":"糁","餱":"糇","緊":"紧","紬":"䌷","絅":"䌹","縶":"絷","綐":"䌼","綵":"䌽","縳":"䌸","繸":"䍁","繿":"䍀","糹":"纟","糾":"纠","紆":"纡","紅":"红","紂":"纣","紇":"纥","約":"约","級":"级","紈":"纨","纊":"纩","紀":"纪","紉":"纫","緯":"纬","紜":"纭","紘":"纮","純":"纯","紕":"纰","紗":"纱","綱":"纲","納":"纳","紝":"纴","縱":"纵","綸":"纶","紛":"纷","紙":"纸","紋":"纹","紡":"纺","紵":"纻","紖":"纼","紐":"纽","紓":"纾","紺":"绀","紲":"绁","紱":"绂","練":"练","組":"组","紳":"绅","細":"细","織":"织","終":"终","縐":"绉","絆":"绊","紼":"绋","絀":"绌","紹":"绍","繹":"绎","經":"经","紿":"绐","綁":"绑","絨":"绒","結":"结","絝":"绔","繞":"绕","絰":"绖","絎":"绗","繪":"绘","給":"给","絢":"绚","絳":"绛","絡":"络","絞":"绞","統":"统","綆":"绠","綃":"绡","絹":"绢","綌":"绤","綏":"绥","繼":"继","綈":"绨","績":"绩","緒":"绪","綾":"绫","緓":"绬","續":"续","綺":"绮","緋":"绯","綽":"绰","緄":"绲","繩":"绳","維":"维","綿":"绵","綬":"绶","綢":"绸","綯":"绹","綹":"绺","綣":"绻","綜":"综","綻":"绽","綰":"绾","綴":"缀","緇":"缁","緙":"缂","緗":"缃","緘":"缄","緬":"缅","纜":"缆","緹":"缇","緲":"缈","緝":"缉","縕":"缊","繢":"缋","緦":"缌","綞":"缍","緞":"缎","緶":"缏","緱":"缑","縋":"缒","緩":"缓","締":"缔","縷":"缕","編":"编","緡":"缗","緣":"缘","縉":"缙","縛":"缚","縟":"缛","縝":"缜","縫":"缝","縗":"缞","縞":"缟","纏":"缠","縭":"缡","縊":"缢","縑":"缣","繽":"缤","縹":"缥","縵":"缦","縲":"缧","纓":"缨","縮":"缩","繆":"缪","繅":"缫","纈":"缬","繚":"缭","繕":"缮","繒":"缯","繾":"缱","繰":"缲","繯":"缳","繳":"缴","纘":"缵","罌":"罂","網":"网","羅":"罗","罰":"罚","罷":"罢","羆":"罴","羈":"羁","羥":"羟","翹":"翘","耮":"耢","耬":"耧","聳":"耸","恥":"耻","聶":"聂","聾":"聋","職":"职","聹":"聍","聯":"联","聵":"聩","聰":"聪","肅":"肃","腸":"肠","膚":"肤","骯":"肮","餚":"肴","腎":"肾","腫":"肿","脹":"胀","脅":"胁","膽":"胆","朧":"胧","腖":"胨","臚":"胪","脛":"胫","膠":"胶","脈":"脉","膾":"脍","臍":"脐","腦":"脑","膿":"脓","臠":"脔","腳":"脚","脫":"脱","腡":"脶","臉":"脸","齶":"腭","膩":"腻","靦":"䩄","膃":"腽","騰":"腾","臏":"膑","臢":"臜","輿":"舆","艤":"舣","艦":"舰","艙":"舱","艫":"舻","艱":"艰","艷":"艳","藝":"艺","節":"节","羋":"芈","薌":"芗","蕪":"芜","蘆":"芦","蓯":"苁","葦":"苇","藶":"苈","莧":"苋","萇":"苌","蒼":"苍","苧":"苎","莖":"茎","蘢":"茏","蔦":"茑","塋":"茔","煢":"茕","繭":"茧","荊":"荆","薦":"荐","薘":"荙","莢":"荚","蕘":"荛","蓽":"荜","蕎":"荞","薈":"荟","薺":"荠","榮":"荣","葷":"荤","滎":"荥","犖":"荦","熒":"荧","蕁":"荨","藎":"荩","蓀":"荪","蔭":"荫","蕒":"荬","葒":"荭","葤":"荮","蒞":"莅","萊":"莱","蓮":"莲","蒔":"莳","萵":"莴","薟":"莶","蕕":"莸","瑩":"莹","鶯":"莺","蘿":"萝","螢":"萤","營":"营","縈":"萦","蕭":"萧","薩":"萨","蔥":"葱","蕆":"蒇","蕢":"蒉","蔣":"蒋","蔞":"蒌","藍":"蓝","薊":"蓟","蘺":"蓠","蕷":"蓣","鎣":"蓥","驀":"蓦","虆":"蔂","薔":"蔷","蘞":"蔹","藺":"蔺","藹":"蔼","薀":"蕰","蘄":"蕲","藪":"薮","薳":"䓕","蘚":"藓","櫱":"蘖","虜":"虏","慮":"虑","虛":"虚","虯":"虬","蟣":"虮","雖":"虽","蝦":"虾","蠆":"虿","蝕":"蚀","蟻":"蚁","螞":"蚂","蠶":"蚕","蜆":"蚬","蠱":"蛊","蠣":"蛎","蟶":"蛏","蠻":"蛮","蟄":"蛰","蛺":"蛱","蟯":"蛲","螄":"蛳","蠐":"蛴","蛻":"蜕","蝸":"蜗","蠅":"蝇","蟈":"蝈","蟬":"蝉","螻":"蝼","蠑":"蝾","螿":"螀","蟎":"螨","螮":"䗖","蠨":"蟏","釁":"衅","銜":"衔","補":"补","襯":"衬","袞":"衮","襖":"袄","裊":"袅","褘":"袆","襪":"袜","襲":"袭","襏":"袯","裝":"装","襠":"裆","褌":"裈","褳":"裢","襝":"裣","褲":"裤","襇":"裥","褸":"褛","襤":"褴","襬":"䙓","見":"见","觀":"观","覎":"觃","規":"规","覓":"觅","視":"视","覘":"觇","覽":"览","覺":"觉","覬":"觊","覡":"觋","覿":"觌","覥":"觍","覦":"觎","覯":"觏","覲":"觐","覷":"觑","觴":"觞","觸":"触","觶":"觯","誾":"訚","訢":"䜣","譽":"誉","謄":"誊","譅":"䜧","訁":"讠","計":"计","訂":"订","訃":"讣","認":"认","譏":"讥","訐":"讦","訌":"讧","討":"讨","讓":"让","訕":"讪","訖":"讫","託":"讬","訓":"训","議":"议","訊":"讯","記":"记","訒":"讱","講":"讲","諱":"讳","謳":"讴","詎":"讵","訝":"讶","訥":"讷","許":"许","訛":"讹","論":"论","訩":"讻","訟":"讼","諷":"讽","設":"设","訪":"访","訣":"诀","證":"证","詁":"诂","訶":"诃","評":"评","詛":"诅","識":"识","詗":"诇","詐":"诈","訴":"诉","診":"诊","詆":"诋","謅":"诌","詞":"词","詘":"诎","詔":"诏","詖":"诐","譯":"译","詒":"诒","誆":"诓","誄":"诔","試":"试","詿":"诖","詩":"诗","詰":"诘","詼":"诙","誠":"诚","誅":"诛","詵":"诜","話":"话","誕":"诞","詬":"诟","詮":"诠","詭":"诡","詢":"询","詣":"诣","諍":"诤","該":"该","詳":"详","詫":"诧","諢":"诨","詡":"诩","譸":"诪","誡":"诫","誣":"诬","語":"语","誚":"诮","誤":"误","誥":"诰","誘":"诱","誨":"诲","誑":"诳","誦":"诵","誒":"诶","請":"请","諸":"诸","諏":"诹","諾":"诺","讀":"读","諑":"诼","誹":"诽","課":"课","諉":"诿","諛":"谀","誰":"谁","諗":"谂","調":"调","諂":"谄","諒":"谅","諄":"谆","誶":"谇","談":"谈","誼":"谊","謀":"谋","諶":"谌","諜":"谍","謊":"谎","諫":"谏","諧":"谐","謔":"谑","謁":"谒","謂":"谓","諤":"谔","諭":"谕","諼":"谖","讒":"谗","諮":"谘","諳":"谙","諺":"谚","諦":"谛","謎":"谜","諞":"谝","諝":"谞","謨":"谟","讜":"谠","謖":"谡","謝":"谢","謗":"谤","謚":"谥","謙":"谦","謐":"谧","謹":"谨","謾":"谩","謫":"谪","謬":"谬","譚":"谭","譖":"谮","譙":"谯","讕":"谰","譜":"谱","譎":"谲","讞":"谳","譴":"谴","譫":"谵","讖":"谶","豶":"豮","貙":"䝙","賰":"䞐","貝":"贝","貞":"贞","負":"负","貟":"贠","貢":"贡","財":"财","責":"责","賢":"贤","敗":"败","賬":"账","貨":"货","質":"质","販":"贩","貪":"贪","貧":"贫","貶":"贬","購":"购","貯":"贮","貫":"贯","貳":"贰","賤":"贱","賁":"贲","貰":"贳","貼":"贴","貴":"贵","貺":"贶","貸":"贷","貿":"贸","費":"费","賀":"贺","貽":"贻","賊":"贼","贄":"贽","賈":"贾","賄":"贿","貲":"赀","賃":"赁","賂":"赂","資":"资","賅":"赅","贐":"赆","賕":"赇","賑":"赈","賚":"赉","賒":"赊","賦":"赋","賭":"赌","贖":"赎","賞":"赏","賜":"赐","贔":"赑","賙":"赒","賡":"赓","賠":"赔","賧":"赕","賴":"赖","賵":"赗","贅":"赘","賻":"赙","賺":"赚","賽":"赛","賾":"赜","贊":"赞","贇":"赟","贈":"赠","贍":"赡","贏":"赢","贛":"赣","赬":"赪","趙":"赵","趕":"赶","趨":"趋","趲":"趱","躉":"趸","躍":"跃","蹌":"跄","躒":"跞","踐":"践","躂":"跶","蹺":"跷","蹕":"跸","躚":"跹","躋":"跻","踴":"踊","躊":"踌","蹤":"踪","躓":"踬","躑":"踯","躡":"蹑","蹣":"蹒","躕":"蹰","躥":"蹿","躪":"躏","躦":"躜","軀":"躯","車":"车","軋":"轧","軌":"轨","軒":"轩","軑":"轪","軔":"轫","轉":"转","軛":"轭","輪":"轮","軟":"软","轟":"轰","軲":"轱","軻":"轲","轤":"轳","軸":"轴","軹":"轵","軼":"轶","軤":"轷","軫":"轸","轢":"轹","軺":"轺","輕":"轻","軾":"轼","載":"载","輊":"轾","轎":"轿","輈":"辀","輇":"辁","輅":"辂","較":"较","輒":"辄","輔":"辅","輛":"辆","輦":"辇","輩":"辈","輝":"辉","輥":"辊","輞":"辋","輬":"辌","輟":"辍","輜":"辎","輳":"辏","輻":"辐","輯":"辑","轀":"辒","輸":"输","轡":"辔","轅":"辕","轄":"辖","輾":"辗","轆":"辘","轍":"辙","轔":"辚","辭":"辞","辯":"辩","辮":"辫","邊":"边","遼":"辽","達":"达","遷":"迁","過":"过","邁":"迈","運":"运","還":"还","這":"这","進":"进","遠":"远","違":"违","連":"连","遲":"迟","邇":"迩","逕":"迳","跡":"迹","選":"选","遜":"逊","遞":"递","邐":"逦","邏":"逻","遺":"遗","遙":"遥","鄧":"邓","鄺":"邝","鄔":"邬","郵":"邮","鄒":"邹","鄴":"邺","鄰":"邻","郟":"郏","鄶":"郐","鄭":"郑","鄆":"郓","酈":"郦","鄖":"郧","鄲":"郸","酇":"酂","醱":"酦","醬":"酱","釅":"酽","釃":"酾","釀":"酿","釋":"释","鑒":"鉴","鑾":"銮","鏨":"錾","釒":"钅","釓":"钆","釔":"钇","針":"针","釘":"钉","釗":"钊","釙":"钋","釕":"钌","釷":"钍","釺":"钎","釧":"钏","釤":"钐","鈒":"钑","釩":"钒","釣":"钓","鍆":"钔","釹":"钕","鍚":"钖","釵":"钗","鈃":"钘","鈣":"钙","鈈":"钚","鈦":"钛","鉅":"钜","鈍":"钝","鈔":"钞","鈉":"钠","鋇":"钡","鋼":"钢","鈑":"钣","鈐":"钤","鑰":"钥","欽":"钦","鈞":"钧","鎢":"钨","鈧":"钪","鈁":"钫","鈥":"钬","鈄":"钭","鈕":"钮","鈀":"钯","鈺":"钰","錢":"钱","鉦":"钲","鉗":"钳","鈷":"钴","鈳":"钶","鉕":"钷","鈽":"钸","鈸":"钹","鉞":"钺","鑽":"钻","鉬":"钼","鉭":"钽","鉀":"钾","鈿":"钿","鈾":"铀","鐵":"铁","鉑":"铂","鈴":"铃","鑠":"铄","鉛":"铅","鉚":"铆","鉋":"铇","鈰":"铈","鉉":"铉","鉈":"铊","鉍":"铋","鈮":"铌","鈹":"铍","鐸":"铎","鉶":"铏","銬":"铐","銠":"铑","鉺":"铒","鋩":"铓","錏":"铔","銪":"铕","鋮":"铖","鋏":"铗","鋣":"铘","鐃":"铙","銍":"铚","鐺":"铛","銅":"铜","鋁":"铝","銱":"铞","銦":"铟","鎧":"铠","鍘":"铡","銖":"铢","銑":"铣","鋌":"铤","銩":"铥","銛":"铦","鏵":"铧","銓":"铨","鎩":"铩","鉿":"铪","銚":"铫","鉻":"铬","銘":"铭","錚":"铮","銫":"铯","鉸":"铰","銥":"铱","鏟":"铲","銃":"铳","鐋":"铴","銨":"铵","銀":"银","銣":"铷","鑄":"铸","鐒":"铹","鋪":"铺","鋙":"铻","錸":"铼","鋱":"铽","鏈":"链","鏗":"铿","銷":"销","鎖":"锁","鋰":"锂","鋥":"锃","鋤":"锄","鍋":"锅","鋯":"锆","鋨":"锇","銼":"锉","鋝":"锊","鋒":"锋","鋅":"锌","鋶":"锍","鐦":"锎","鐧":"锏","銻":"锑","鋃":"锒","鋟":"锓","鋦":"锔","錒":"锕","錆":"锖","鍺":"锗","鍩":"锘","錯":"错","錨":"锚","錛":"锛","錡":"锜","鍀":"锝","錁":"锞","錕":"锟","錩":"锠","錫":"锡","錮":"锢","鑼":"锣","錐":"锥","錦":"锦","鑕":"锧","錈":"锩","鍃":"锪","錇":"锫","錟":"锬","錠":"锭","鍵":"键","鋸":"锯","錳":"锰","錙":"锱","鍥":"锲","鍈":"锳","鍇":"锴","鏘":"锵","鍶":"锶","鍔":"锷","鍤":"锸","鍬":"锹","鍾":"锺","鍛":"锻","鎪":"锼","鍠":"锽","鍰":"锾","鎄":"锿","鍍":"镀","鎂":"镁","鏤":"镂","鎡":"镃","鐨":"镄","鎇":"镅","鏌":"镆","鎮":"镇","鎛":"镈","鎘":"镉","鑷":"镊","鎲":"镋","鎳":"镍","鎿":"镎","鎦":"镏","鎬":"镐","鎊":"镑","鎰":"镒","鎵":"镓","鑌":"镔","鎔":"镕","鏢":"镖","鏜":"镗","鏝":"镘","鏍":"镙","鏰":"镚","鏞":"镛","鏡":"镜","鏑":"镝","鏃":"镞","鏇":"镟","鏐":"镠","鐔":"镡","鐐":"镣","鏷":"镤","鑥":"镥","鐓":"镦","鑭":"镧","鐠":"镨","鑹":"镩","鏹":"镪","鐙":"镫","鑊":"镬","鐳":"镭","鐶":"镮","鐲":"镯","鐮":"镰","鐿":"镱","鑔":"镲","鑣":"镳","鑞":"镴","鑱":"镵","鑲":"镶","長":"长","門":"门","閂":"闩","閃":"闪","閆":"闫","閈":"闬","閉":"闭","問":"问","闖":"闯","閏":"闰","闈":"闱","閑":"闲","閎":"闳","間":"间","閔":"闵","閌":"闶","悶":"闷","閘":"闸","鬧":"闹","閨":"闺","聞":"闻","闥":"闼","閩":"闽","閭":"闾","闓":"闿","閥":"阀","閣":"阁","閡":"阂","閫":"阃","鬮":"阄","閬":"阆","闍":"阇","閾":"阈","閹":"阉","閶":"阊","鬩":"阋","閿":"阌","閽":"阍","閻":"阎","閼":"阏","闡":"阐","闌":"阑","闃":"阒","闠":"阓","闊":"阔","闋":"阕","闔":"阖","闐":"阗","闒":"阘","闕":"阙","闞":"阚","闤":"阛","隊":"队","陽":"阳","陰":"阴","陣":"阵","階":"阶","際":"际","陸":"陆","隴":"陇","陳":"陈","陘":"陉","陝":"陕","隉":"陧","隕":"陨","險":"险","隨":"随","隱":"隐","隸":"隶","雋":"隽","難":"难","雛":"雏","讎":"雠","靂":"雳","霧":"雾","霽":"霁","霢":"霡","靄":"霭","靚":"靓","靜":"静","靨":"靥","韃":"鞑","鞽":"鞒","韉":"鞯","韋":"韦","韌":"韧","韍":"韨","韓":"韩","韙":"韪","韞":"韫","韜":"韬","韻":"韵","頁":"页","頂":"顶","頃":"顷","頇":"顸","項":"项","順":"顺","頊":"顼","頑":"顽","顧":"顾","頓":"顿","頎":"颀","頒":"颁","頌":"颂","頏":"颃","預":"预","顱":"颅","領":"领","頗":"颇","頸":"颈","頡":"颉","頰":"颊","頲":"颋","頜":"颌","潁":"颍","熲":"颎","頦":"颏","頤":"颐","頻":"频","頮":"颒","頷":"颔","頴":"颕","穎":"颖","顆":"颗","題":"题","顒":"颙","顎":"颚","顓":"颛","額":"额","顳":"颞","顢":"颟","顛":"颠","顙":"颡","顥":"颢","顫":"颤","顬":"颥","顰":"颦","顴":"颧","風":"风","颺":"飏","颭":"飐","颮":"飑","颯":"飒","颶":"飓","颸":"飔","颼":"飕","颻":"飖","飀":"飗","飄":"飘","飆":"飙","飈":"飚","飛":"飞","饗":"飨","饜":"餍","飠":"饣","飣":"饤","飥":"饦","餳":"饧","飩":"饨","餼":"饩","飪":"饪","飫":"饫","飭":"饬","飯":"饭","飲":"饮","餞":"饯","飾":"饰","飽":"饱","飼":"饲","飿":"饳","飴":"饴","餌":"饵","饒":"饶","餉":"饷","餄":"饸","餎":"饹","餃":"饺","餏":"饻","餅":"饼","餑":"饽","餖":"饾","餓":"饿","餒":"馁","餕":"馂","餜":"馃","餛":"馄","餡":"馅","館":"馆","餷":"馇","饋":"馈","餶":"馉","餿":"馊","饞":"馋","饁":"馌","饃":"馍","餺":"馎","餾":"馏","饈":"馐","饉":"馑","饅":"馒","饊":"馓","饌":"馔","饢":"馕","騧":"䯄","馬":"马","馭":"驭","馱":"驮","馴":"驯","馳":"驰","驅":"驱","馹":"驲","駁":"驳","驢":"驴","駔":"驵","駛":"驶","駟":"驷","駙":"驸","駒":"驹","騶":"驺","駐":"驻","駝":"驼","駑":"驽","駕":"驾","驛":"驿","駘":"骀","驍":"骁","駰":"骃","驕":"骄","驊":"骅","駱":"骆","駭":"骇","駢":"骈","驫":"骉","驪":"骊","騁":"骋","驗":"验","騂":"骍","駸":"骎","駿":"骏","騏":"骐","騎":"骑","騍":"骒","騅":"骓","騌":"骔","驌":"骕","驂":"骖","騙":"骗","騭":"骘","騤":"骙","騷":"骚","騖":"骛","驁":"骜","騮":"骝","騫":"骞","騸":"骟","驃":"骠","騾":"骡","驄":"骢","驏":"骣","驟":"骤","驥":"骥","驦":"骦","驤":"骧","髏":"髅","髖":"髋","髕":"髌","鬢":"鬓","魘":"魇","魎":"魉","魚":"鱼","魛":"鱽","魢":"鱾","魷":"鱿","魨":"鲀","魯":"鲁","魴":"鲂","䰾":"鲃","魺":"鲄","鮁":"鲅","鮃":"鲆","鱸":"鲈","鮋":"鲉","鮓":"鲊","鮒":"鲋","鮊":"鲌","鮑":"鲍","鱟":"鲎","鮍":"鲏","鮐":"鲐","鮭":"鲑","鮚":"鲒","鮳":"鲓","鮪":"鲔","鮞":"鲕","鮦":"鲖","鰂":"鲗","鮜":"鲘","鱠":"鲙","鱭":"鲚","鮫":"鲛","鮮":"鲜","鮺":"鲝","鱘":"鲟","鯁":"鲠","鱺":"鲡","鰱":"鲢","鰹":"鲣","鯉":"鲤","鰣":"鲥","鰷":"鲦","鯀":"鲧","鯊":"鲨","鯇":"鲩","鮶":"鲪","鯽":"鲫","鯒":"鲬","鯖":"鲭","鯪":"鲮","鯕":"鲯","鯫":"鲰","鯡":"鲱","鯤":"鲲","鯧":"鲳","鯝":"鲴","鯢":"鲵","鯛":"鲷","鯨":"鲸","鰺":"鲹","鯴":"鲺","鯔":"鲻","鱝":"鲼","鰈":"鲽","鰏":"鲾","鱨":"鲿","鯷":"鳀","鰮":"鳁","鰃":"鳂","鰓":"鳃","鰍":"鳅","鰒":"鳆","鰉":"鳇","鰁":"鳈","鱂":"鳉","鯿":"鳊","鰠":"鳋","鰲":"鳌","鰭":"鳍","鰨":"鳎","鰥":"鳏","鰩":"鳐","鰟":"鳑","鰜":"鳒","鰳":"鳓","鰾":"鳔","鱈":"鳕","鱉":"鳖","鰻":"鳗","鰵":"鳘","鱅":"鳙","䲁":"鳚","鰼":"鳛","鱖":"鳜","鱔":"鳝","鱗":"鳞","鱒":"鳟","鱯":"鳠","鱤":"鳡","鱧":"鳢","鱣":"鳣","鳾":"䴓","鴷":"䴕","鵁":"䴔","鶄":"䴖","鶪":"䴗","鷈":"䴘","鷿":"䴙","鸂":"㶉","鳥":"鸟","鳩":"鸠","鳶":"鸢","鳴":"鸣","鳲":"鸤","鷗":"鸥","鴉":"鸦","鶬":"鸧","鴇":"鸨","鴆":"鸩","鴣":"鸪","鶇":"鸫","鸕":"鸬","鴨":"鸭","鴞":"鸮","鴦":"鸯","鴒":"鸰","鴟":"鸱","鴝":"鸲","鴛":"鸳","鷽":"鸴","鴕":"鸵","鷥":"鸶","鷙":"鸷","鴯":"鸸","鴰":"鸹","鵂":"鸺","鴴":"鸻","鵃":"鸼","鴿":"鸽","鸞":"鸾","鴻":"鸿","鵐":"鹀","鵓":"鹁","鸝":"鹂","鵑":"鹃","鵠":"鹄","鵝":"鹅","鵒":"鹆","鷳":"鹇","鵜":"鹈","鵡":"鹉","鵲":"鹊","鶓":"鹋","鵪":"鹌","鵾":"鹍","鵯":"鹎","鵬":"鹏","鵮":"鹐","鶉":"鹑","鶊":"鹒","鵷":"鹓","鷫":"鹔","鶘":"鹕","鶡":"鹖","鶚":"鹗","鶻":"鹘","鶖":"鹙","鶥":"鹛","鶩":"鹜","鷊":"鹝","鷂":"鹞","鶲":"鹟","鶹":"鹠","鶺":"鹡","鷁":"鹢","鶼":"鹣","鶴":"鹤","鷖":"鹥","鸚":"鹦","鷓":"鹧","鷚":"鹨","鷯":"鹩","鷦":"鹪","鷲":"鹫","鷸":"鹬","鷺":"鹭","鸇":"鹯","鷹":"鹰","鸌":"鹱","鸏":"鹲","鸛":"鹳","鸘":"鹴","鹺":"鹾","麥":"麦","麩":"麸","黃":"黄","黌":"黉","黶":"黡","黷":"黩","黲":"黪","黽":"黾","黿":"鼋","鼉":"鼍","鞀":"鼗","鼴":"鼹","齊":"齐","齏":"齑","齒":"齿","齔":"龀","齕":"龁","齗":"龂","齟":"龃","齡":"龄","齙":"龅","齠":"龆","齜":"龇","齦":"龈","齬":"龉","齪":"龊","齲":"龋","齷":"龌","龍":"龙","龔":"龚","龕":"龛","龜":"龟","衝":"冲","繃":"绷","鬆":"松","餵":"喂","麼":"么","隻":"双","裡":"里","溼":"湿","幹":"干","翺":"翱","鼈":"鳖","蔔":"卜","産":"产","癡":"痴","蕩":"荡","叠":"迭","複":"复","臯":"皋","鈎":"钩","矽":"硅","彙":"汇","饑":"饥","堿":"碱","稭":"秸","淨":"净","裏":"里","曆":"历","淩":"凌","鹵":"卤","黴":"霉","撚":"捻","齧":"啮","甯":"宁","啓":"启","扡":"扦","擡":"抬","歎":"叹","縧":"绦","爲":"为","僞":"伪","甕":"瓮","鍁":"锨","鹹":"咸","羨":"羡","蠍":"蝎","鏽":"锈","勳":"勋","顔":"颜","彜":"彝","湧":"涌","遊":"游","籲":"吁","禦":"御","嶽":"岳","髒":"脏","紮":"扎","劄":"札","衆":"众","緻":"致","兇":"凶","闆":"板","鍊":"链","洩":"泄"};
    var str = text.split("");
    var len = str.length;
    for (var i = 0; i < len; i++) {
        str[i] = dict[str[i]] || str[i];
    }
    return str.join("");
}


function filterTag(text){
    text = text.replace(/<(br|address|blockquote|center|dir|div|dl|fieldset|form|h1|h2|h3|h4|h5|h6|hr|isindex|menu|noframes|noscript|ol|p|pre|table|ul)[^<>]*?>/g,"\n");
    text = text.replace(/(<[^<>]*?>)/g,function($,$1){
        if ($1.match(/<a|<img|<\/a|<base|<link|<base/))return $1;
        return '';
    });
    return text;
}

//清除标题
function clearTitle(text){
    text = text.replace(/([\(（\[【].*?[\)）\]】])/gi,function ($,$1){
        //if (text.indexOf($1) == 0) return $1;
        if ($1.match(/月票|推荐票|推荐|订阅|支持|收藏|加更|字数/)) return "";
        if ($1.match(/[1-9一二两三四五六七八九十○零百千万亿〇１２３４５６７８９０]更/)) return "";
        if ($1.match(/[二两三四五六七八九十]合一/))return "";
        //if (!$1.match(/[上中下续章回卷节折篇幕集部1-9一二两三四五六七八九十○零百千万亿〇１２３４５６７８９０]/))return "";
        return $1;
    });
    return replace(text,['《','》']);
}


function filterInvalidPathChar(text){
    return replace(text,{"\\.+$":"","^\\.+":"",":":"：","\\?":"？","\\*":"","\\\\":"","\\/":"","\\|":"","<":"",">":"","\"":"'"});
}
//修复web格式
function webFormatFix(text){
    return replace(text,{"\\*|＊":"*","[wWｗＷ]{3}":"www","w{3}(\u3001|\u3002)":"www.","[cCｃＣ][oOｏＯ][mMｍＭ]":"com","[nNｎＮ][eｅEＥ][tｔTＴ]":"net","[cCｃＣ][nNｎＮ]":"cn","(\\.|\u3001|\u3002)com":".com","(\\.|\u3001|\u3002)net":".net","(\\.|\u3001|\u3002)cn":".cn","[pPｐＰ][sSｓＳ][:：]":"ps:","。{5,7}":"……","~{2,50}":"——","…{3,40}": "……","－{3,20}":"——","\\[+CP.*(http://file.*\\.jpg)\\]+": "<img src='$1'>","@{3,}": "",});
}
//星号屏蔽字还原
function fixMaskWords(text){
    return replace(text,{"(\\*{2})玄功":"八九玄功","十有(\\*{2})":"十有八九","十有bā'九":"十有八九",  "\\*{2}不离十":"八九不离十","G(\\*{2})":"GSM", "感(\\*{2})彩":"感情色彩","(三|两|帝)\\*\\*(队|事|人|纪|官|力|营)":"$1国军$2","帝\\*\\*":"帝国军","\\*\\*师":"大法师","水\\*\\*融":"水乳交融","强(\\*{2})u5B9D":"强大法宝","(\\*{2})凡胎": "肉体凡胎",});
}
//多字替换
function fixMultiWords(text){
    return replace(text,{"cao之过急":"操之过急", "chunguang大泄":"春光大泄","大公无si":"大公无私","fu道人家":"妇道人家", "放sōng'xià来":"放松下来","奸yin掳掠":"奸淫掳掠","空dangdang":"空荡荡","突发qing况": "突发情况","yin奉阳违":"阴奉阳违", "一yin一阳":"一阴一阳",});
}
//双字替换
function fixDoubleWords(text){
    return replace(text,{"暧m[eè][iì]":"暧昧","bàn\\s*fǎ":"办法", "bucuo":"不错", "不liáng":"不良", "b[ěe]i(\\s|&nbsp;)*j[īi]ng":"北京","半shen": "半身", "b[ìi]j[ìi]ng":"毕竟", "报(了?)jing":"报$1警", "bèi'pò":"被迫", "包yǎng":"包养", "(?:biǎo|婊\\\\?)子":"婊子", "biǎo\\s*xiàn\\s*":"表现","chifan":"吃饭", "ch[oō]ngd[oò]ng":"冲动", "chong物":"宠物", "cao(练|作)":"操$1", "出gui":"出轨", "chu\\s*xian":"出现", "缠mian": "缠绵", "成shu": "成熟", "(?:赤|chi)\\s*lu[oǒ]": "赤裸", "春guang": "春光", "chun风":"春风", "chuang伴":"床伴", "沉mi":"沉迷", "沉lun":"沉沦", "刺ji":"刺激", "chao红":"潮红", "初chun":"初春", "＂ｃｈｉ　ｌｕｏ＂":"赤裸","dān\\s*xīn":"当心", "dang校": "党校", "da子": "鞑子", "大tui":"大腿", "dǎ\\s*suàn":"打算", "dengdai":"等待", "电huà":"电话", "diao丝": "屌丝", "d[úu](?:\\s|&nbsp;|<br/>)*l[ìi]": "独立", "d[uú]\\s{0,2}c[áa]i":"独裁",  "d?[iì]f[āa]ng":"地方", "d[ìi]\\s*d[ūu]":"帝都", "di国|帝guo":"帝国", "du[oò]落":"堕落", "坠luò":"坠落","f[ǎa]ngf[óo]":"仿佛", "fei踢": "飞踢", "feng流": "风流", "风liu": "风流", "f[èe]nn[ùu]":"愤怒", "fǎn\\s*yīng":"反应","gao潮": "高潮", "高氵朝":"高潮", "gāo\\s*xìng\\s*":"高兴", "干chai": "干柴", "勾yin":"勾引", "gu[oò]ch[ée]ng":"过程", "gu[āa]n\\s*x[iì]":"关系", "g[ǎa]nji[àa]o":"感觉", "国wu院":"国务院", "gù\\s*yì\\s*":"故意", "guofen":"过分","guī头":"龟头","hā\\s*hā\\s*":"哈哈", "h[aǎ]ode":"好的", "hù士":"护士", "火qiang":"火枪", "há'guó":"韩国", "han住": "含住", "hai洛因": "海洛因", "红fen": "红粉", "火yao": "火药", "h[ǎa]oxi[àa]ng":"好像", "hu[áa]ngs[èe]":"黄色", "皇d[ìi]":"皇帝", "昏昏yu睡":"昏昏欲睡", "回dang":"回荡", "huí\\s*qù\\s*":"回去", "hé\\s*shì\\s*":"合适","jian(臣|细)":"奸$1", "奸yin":"奸淫", "jiànmiàn":"见面", "jian货":"贱货", "jing察":"警察", "j[ìi]nháng":"进行", "jīng\\s*guò":"经过", "ji烈":"激烈", "j[iì](nv|女)": "妓女", "jirou": "鸡肉", "ji者":"记者", "jì\\s*xù\\s*":"继续", "ju花":"菊花","j[īi]动":"激动", "jili[èe]":"激烈", "肌r[òo]u":"肌肉","ji射":"激射", "ji[ēe]ch[uù]":"接触", "jiù\\s*shì":"就是", "j[ùu]li[èe]": "剧烈", "jǐng惕": "警惕", "节cao":"节操", "浸yin":"浸淫", "jù\\s*jué\\s*":"拒绝", "jue色":"角色","jīng液":"精液","k[ěe]n[ée]ng": "可能", "开bao": "开苞",  "k[àa]o近": "靠近", "口wen":"口吻", "kankan":"看看","ling辱": "凌辱", "luan蛋": "卵蛋", "脸sè": "脸色", "lu出":"露出", "流máng":"流氓", "lun理":"伦理", "lì\\s*qì":"力气","m[ǎa]ny[ìi]":"满意", "m[ǎa]sh[àa]ng":"马上", "m[ée]iy[oǒ]u":"没有", "mei国": "美国", "m[íi]ngb[áa]i":"明白", "迷huan": "迷幻", "mi茫":"迷茫", "mó\\s*yàng":"模样", "m[íi]n\\s{0,2}zh[ǔu]": "民主", "迷jian": "迷奸", "mimi糊糊":"迷迷糊糊", "末(?:\\s|<br/?>)*ì":"末日", "面se":"面色", "mengmeng":"蒙蒙","mī穴":"蜜穴","nàme":"那么", "n[ǎa]o\\s*d[àa]i":"脑袋", "n[ée]ngg[oò]u":"能够", "nán\\s{0,2}hǎi": "那会", "内jian":"内奸", "[内內]y[iī]":"内衣", "内ku":"内裤","pi[áa]o客":"嫖客", "p[áa]ngbi[āa]n":"旁边","q[íi]gu[àa]i":"奇怪", "qing\\s*(ren|人)":"情人", "qin兽":"禽兽", "q[iī]ngch[uǔ]":"清楚", "què\\s*dìng":"确定", "球mi":"球迷", "青chun":"青春", "青lou":"青楼", "qingkuang":"情况", "qiang[　\\s]*jian":"强奸","re\\s*nao":"热闹", "r[úu]gu[oǒ]":"如果", "r[oó]ngy[ìi]":"容易", "ru(房|白色)": "乳$1", "rén员":"人员", "rén形":"人形", "人chao":"人潮",  "renmen":"人名","ròu棒":"肉棒","rǔ头":"乳头","上jiang":"上将", "she(门|术|手|程|击)":"射$1", "sudu":"速度", "shuijue":"睡觉", "shide":"是的", "sh[iì]ji[eè]":"世界", "sh[ií]ji[aā]n":"时间", "sh[ií]h[oò]u": "时候", "sh[ií]me":"什么", "si人":"私人", "shi女":"侍女", "shi身": "失身", "sh[ūu]j[ìi]":"书记", "shu女": "熟女", "shu[　\\s]?xiong":"酥胸", "(?:上|shang)chuang": "上床", "呻y[íi]n": "呻吟", "sh[ēe]ngzh[íi]": "生殖", "深gu": "深谷", "双xiu": "双修", "生r[ìi]": "生日", "si盐":"私盐", "shi卫":"侍卫", "si下":"私下", "sao扰":"骚扰", "ｓｈｕａｎｇ　ｆｅｎｇ":"双峰","shè精":"射精","t[uū]r[áa]n":"突然", "tiaojiao": "调教", "偷qing":"偷情", "推dao": "推倒", "脱guang": "脱光", "t[èe]bi[ée]":"特别", "t[ōo]nggu[òo]":"通过", "同ju":"同居", "tian来tian去":"舔来舔去","w[ēe]ixi[ée]":"威胁", "wèizh[ìi]":"位置", "wei员":"委员", "w[èe]nti":"问题", "wèi\\s*dào\\s*":"味道", "wú\\s*nài":"无奈", "weilai":"未来","xiu长": "修长", "亵du": "亵渎", "xing福": "幸福", "小bo":"小波", "小niū":"小妞", "xiong([^a-z])":"胸$1", "小tui":"小腿", "xiang港":"香港", "xiàohuà":"笑话", "xiàn\\'zhì":"限制", "xiōng\\s*dì":"兄弟","xiāo穴":"小穴","yì\\s*wài\\s*":"意外", "yin(冷|暗|谋|险|沉|沟|癸派|后)":"阴$1", "y[iī]y[àa]ng":"一样", "y[īi]di[ǎa]n":"一点", "yī\\s*zhèn":"一阵", "y[ǐi]j[īi]ng":"已经", "疑huo":"疑惑", "yí\\s*huò":"疑惑", "影mi":"影迷", "yin荡":"淫荡", "yin贼":"淫贼", "阳w[ěe]i": "阳痿", "yao头": "摇头", "yaotou": "摇头", "摇tou": "摇头", "yezhan": "野战", "you饵": "诱饵", "(?:you|诱)(?:惑|huo)": "诱惑", "you导": "诱导", "引you": "引诱", "you人": "诱人", "youshi":"有事", "you\\s*xiu":"优秀", "御yòng":"御用", "旖ni":"旖旎", "yu念":"欲念", "you敌深入":"诱敌深入", "影she":"影射", "牙qian":"牙签", "一yè情":"一夜情","yáng具":"阳具","yín水":"淫水","z[iì]j[iǐ]": "自己","z[ìi](?:\\s|<br/?>|&nbsp;)*y[oó]u": "自由","zh[iī]d?[àa]u?o":"知道", "zixin":"自信", "zhì'fú":"制服", "zha药": "炸药", "zhan有": "占有", "zhè\\s*gè":"这个", "政f[ǔu]|zheng府": "政府", "zh[èe]ng\\s{0,2}f[uǔ]": "政府", "zong理":"总理", "zh[ōo]ngy[āa]ng": "中央", "中yang":"中央", "zu[oǒ]\\s*y[oò]u":"左右", "zhǔ\\s*dòng":"主动", "zh[oō]uw[ée]i":"周围", "中nan海":"中南海", "中j委":"中纪委", "中zu部":"中组部", "政zhi局":"政治局", "(昨|一|时|余)(?:<br/?>|&nbsp;|\\s)*ì":"$1日", "照she":"照射", "zhǔn\\s*bèi\\s*":"准备", "zhu义":"主义","</p>\\n<p>\\s*ì":"日",});
}
//标题过滤
function filterTitle(text){
    return replace(text,{"www.23＋?[Ｗw][Ｘx].[Ｃc]om":"","[;\\(]顶.{0,2}点.小说":"","(【|\\[)?第[一二两三四五六七八九十○零百千万亿〇0-9１２３４５６７８９０]{1,6}\\s*[章回卷节折篇幕集部].{0,30}\\n":"","章[一二两三四五六七八九十○零百千万亿〇0-9１２３４５６７８９０]{3,6}.{0,30}\\n":"","'ads_wz_txt;',|最新.?章节|百度搜索|无弹窗小说网|更新快无弹窗纯文字|高品质更新|小说章节更新最快|\\(百度搜.\\)|全文字手打|“”&nbsp;看|无.弹.窗.小.说.网|追书网":"","[\\(（【]?未完待续.*?[\\)）]":"","[\\(（【]?未完待续.*":"","\\(.*?公众号“qdread”.*?\\)":"","(\\W)[Rr][QqTtSsPpUu]":"$1",});
}

//去除广告
function removeHTMLAD(text){
    return replace(text,[
        "\\[搜索最新更新尽在[a-z\\.]+\\]","<a>手机用户请到m.qidian.com阅读。</a>",".{2,4}中文网欢迎广大书友","访问下载txt小说|◎雲來閣免费万本m.yunlaige.com◎","〖∷更新快∷无弹窗∷纯文字∷.*?〗","本文由　。。　首发",'”小说“小说章节更新最快','如果觉得好看，请把本站网址推荐给您的朋友吧！','本站手机网址：&nbsp;&nbsp;请互相通知向您QQ群【微博/微信】论坛贴吧推荐宣传介绍!',"fqXSw\\.com","\\.5ｄｕ|\\.５du５\\.","\\[\\]","如果您觉得网不错就多多分享本站谢谢各位读者的支持","全文字无广告|\\(看书窝&nbsp;看书窝&nbsp;无弹窗全文阅读\\)","。。+[\\s　]*看最新最全小说","水印广告测试","\\(平南文学网\\)","讀蕶蕶尐說網","比奇提示：如何快速搜自己要找的书籍","《百度书名\\+比奇》即可快速直达","~无~错~小~说","\\(一秒记住小说界\\）|\\*一秒记住\\*","uutxt\\.org|3vbook\\.cn|www\\.qbwx\\.com|WWw\\.YaNkuai\\.com|www\\.btzw\\.com|www\\.23uS\\.com","txt53712/",{"\xa0{4,12}":"\xa0\xa0\xa0\xa0"},"[wｗＷ]{1,3}[．\\.]２３ｕＳ[．\\.](?:ｃｏＭ|com)",
    ]);
}

function removeTextAD(text){
    return replace(text,[
        '本书由.*?首发，请勿转载！','一秒记住.*?为您提供精彩小说阅读。','纯文字在线阅读本站域名手机同步阅读请访问','\\(?未完待续请搜索飄天文學，小说更好更新更快!','-优－优－小－说－更－新－最－快-www.ＵＵＸＳ.ＣＣ-','【阅读本书最新章节，请搜索800】','亲，百度搜索眼&amp;快，大量小说免费看。','\\|每两个看言情的人当中，就有一个注册过可°乐°小°说°网的账号。','最新章节全文阅读看书神器\\.yankuai\\.','（800小说网 www.800Book.net 提供Txt免费下载）最新章节全文阅读-..-','\\[看本书最新章节请到求书 .\\]','\\[800\\]\\[站页面清爽，广告少，','\\|优\\|优\\|小\\|说\\|更\\|新\\|最\\|快\\|www.uuxs.cc\\|','看本书最新章节请到800小说网（www.800book.net）','（800小说网 www.800Book.net 提供Txt免费下载）','热门小说最新章节全文阅读.。 更新好快。','-优－优－小－说－更－新－最－快x','亲，眼&快，大量小说免费看。','手机看小说哪家强手机阅','思ˊ路ˋ客，更新最快的！','（本章未完，请翻页）','最新章节全文阅读（..首发）','最新章节全文阅读【首发】','最新章节全文阅读','来可乐网看小说','txt电子书下载/','txt全集下载','txt小说下载','（\\s*君子聚义堂）','readx;','追书必备','樂文小说',

        // 包含 \P 的替换
        '[\\u2000-\\u2FFF\\u3004-\\u303F\\uFE00-\\uFF60\\uFFC0-\\uFFFF]{1,2}[顶頂].{1,3}[点小].*?o?[mw，]','[\\u2000-\\u2FFF\\u3004-\\u303F\\uFE00-\\uFF60\\uFFC0-\\uFFFF].?长.{1,2}风.{1,2}文.{1,2}学.*?[tx]','[\\u2000-\\u2FFF\\u3004-\\u303F\\uFE00-\\uFF60\\uFFC0-\\uFFFF]无.错.*?[cＣ][oＯ][mＭ]','[;\\(]顶.{0,2}点.小说','2长2风2文2学，w￠＄','》长>风》',

        // 包含 .* 的，可能有多余的替换
        '如您已(?:閱讀|阅读)到此章节.*?敬请记住我们新的网址\\s*。','↗百度搜：.*?直达网址.*?↖',"[:《〈｜~∨∟∑]{1,2}长.{1,2}风.*?et",'\\[限时抢购\\].*','支持网站发展.逛淘宝买东西就从这里进.*','ps[：:]想听到更多你们的声音，想收到更多你们的建议，现在就搜索微信公众号“qdread”并加关注，给.*?更多支持！','(?:ps[:：])?看《.*?》背后的独家故事.*?告诉我吧！','（?天上掉馅饼的好活动.*?微信公众号！）?','（微信添加.*qdread微信公众号！）','jiemei如您已阅读到此章节，请移步到.*?\\[ads:本站换新网址啦，速记方法：，.\\]',

        // 短文字替换
        '\\[txt全集下载\\]','\\[\\s*超多好看小说\\]','⊙四⊙五⊙中⊙文☆→','\\[ads:本站换新网址啦，速记方法：.*?\\]','[》《｜～]无(?:.|&gt;)错(?:.|&gt;)小说','`无`错`小说`www.``com', '＋无＋错＋小说＋3w＋＋','\\|优\\|优\\|小\\|说\\|更\\|新\\|最\\|快Ｘ','▲∴', '8，ww←',/www.23＋?[Ｗw][Ｘx].[Ｃc]om/ig,/热门推荐:、+/g,/h2&gt;/g,'[《〈》>\\+｜～［\\]]无\\1错\\1', '》无>错》','女凤免费小说抢先看', '女凤小说网全文字 无广告','乐文小说网?', '《乐〈文《小说', '乐文移动网', '頂点小说', '頂點小說','追小说哪里快去眼快','\\[书库\\].\\[774\\]\\[buy\\].kuai',/'ads_wz_txt;',|百度搜索|无弹窗小说网|更新快无弹窗纯文字|高品质更新|小说章节更新最快|\(百度搜.\)|全文字手打|“”&nbsp;看|无.弹.窗.小.说.网|追书网|〖∷∷无弹窗∷纯文字∷ 〗/g,
    ]);
}
//修复标点
function fixPunctuation(text){
    return replace(text,{"．":".","^\\.$":"","。{5,}":"……","~{3,}":"——","…{3,}": "……","－{3,}":"——","[\\.。]{3,}":"……","@{3,}": "","^[\\s\\.]*":"","([。\\.．]\\s*){3,}":"……\n","[\\t\\r\\n\\f]+":"\n","\\n+":"\n","^\\s*|\\s*$":""})
}
//单字替换
function oneWordReplace(text){
    return replace(text,{"([^a-z\\s])b[āà]ng(?![a-z\\s])":"$1棒","([^a-z\\s])bào(?![a-z\\s])":"$1爆","([^a-z\\s])bà(?![a-z\\s])":"$1吧","([^a-z\\s])bī(?![a-z\\s])":"$1逼","([^a-z\\s])bō(?![a-z\\s])":"$1波","([^a-z\\s])cāo(?![a-z\\s])":"$1操","([^a-z\\s])cǎo(?![a-z\\s])":"$1草","([^a-z\\s])cào(?![a-z\\s])":"$1操","([^a-z\\s])chāng(?![a-z\\s])":"$1娼","([^a-z\\s])chang(?![a-z\\s])":"$1娼","([^a-z\\s])cháo(?![a-z\\s])":"$1潮","([^a-z\\s])chā(?![a-z\\s])":"$1插","([^a-z\\s])chéng(?![a-z\\s])":"$1成","([^a-z\\s])chōu(?![a-z\\s])":"$1抽","([^a-z\\s])chuáng(?![a-z\\s])":"$1床","([^a-z\\s])chún(?![a-z\\s])":"$1唇","([^a-z\\s])chūn(?![a-z\\s])":"$1春","([^a-z\\s])cuō(?![a-z\\s])":"$1搓","([^a-z\\s])cū(?![a-z\\s])":"$1粗","([^a-z\\s])dǎng(?![a-z\\s])":"$1党","([^a-z\\s])dàng(?![a-z\\s])":"$1荡","([^a-z\\s])dāo(?![a-z\\s])":"$1刀","([^a-z\\s])dòng(?![a-z\\s])":"$1洞","([^a-z\\s])diao(?![a-z\\s])":"$1屌","([^a-z\\s])diǎn(?![a-z\\s])":"$1点","([^a-z\\s])fǎ(?![a-z\\s])":"$1法","([^a-z\\s])féi(?![a-z\\s])":"$1肥","([^a-z\\s])fù(?![a-z\\s])":"$1妇","([^a-z\\s])guān(?![a-z\\s])":"$1官","([^a-z\\s])hán(?![a-z\\s])":"$1含","([^a-z\\s])hóu(?![a-z\\s])":"$1喉","([^a-z\\s])hòu(?![a-z\\s])":"$1厚","([^a-z\\s])h(u)?ā(?![a-z\\s])":"$1花","([^a-z\\s])huá(?![a-z\\s])":"$1华","([^a-z\\s])huò(?![a-z\\s])":"$1惑","([^a-z\\s])hùn(?![a-z\\s])":"$1混","([^a-z\\s])hún(?![a-z\\s])":"$1魂","([^a-z\\s])jiǔ(?![a-z\\s])":"$1九","([^a-z\\s])jīng(?![a-z\\s])":"$1精","([^a-z\\s])jìn(?![a-z\\s])":"$1禁","([^a-z\\s])jǐng(?![a-z\\s])":"$1警","([^a-z\\s])jiāng(?![a-z\\s])":"$1江","([^a-z\\s])jiān(?![a-z\\s])":"$1奸","([^a-z\\s])jiāo(?![a-z\\s])":"$1交","([^a-z\\s])jūn(?![a-z\\s])":"$1军","([^a-z\\s])jū(?![a-z\\s])":"$1拘","([^a-z\\s])jú(?![a-z\\s])":"$1局","([^a-z\\s])jī(?![a-z\\s])":"$1激","([^a-z\\s])激ān(?![a-z\\s])":"$1奸","([^a-z\\s])kù(?![a-z\\s])":"$1裤","([^a-z\\s])kàn(?![a-z\\s])":"$1看","([^a-z\\s])[1l]àng(?![a-z\\s])":"$1浪","([^a-z\\s])liáo(?![a-z\\s])":"$1撩","([^a-z\\s])liú(?![a-z\\s])":"$1流","([^a-z\\s])lì(?![a-z\\s])":"$1莉","([^a-z\\s])liè(?![a-z\\s])":"$1烈","([^a-z\\s])[1l]uàn(?![a-z\\s])":"$1乱","([^a-z\\s])lún(?![a-z\\s])":"$1伦","([^a-z\\s])luǒ(?![a-z\\s])":"$1裸","([^a-z\\s])lou(?![a-z\\s])":"$1露","([^a-z\\s])lòu(?![a-z\\s])":"$1露","([^a-z\\s])[l1]ù(?![a-z\\s])":"$1露","([^a-z\\s])lǜ(?![a-z\\s])":"$1绿","([^a-z\\s])mǎi(?![a-z\\s])":"$1买","([^a-z\\s])mài(?![a-z\\s])":"$1卖","([^a-z\\s])máo(?![a-z\\s])":"$1毛","([^a-z\\s])mā(?![a-z\\s])":"$1妈","([^a-z\\s])méng(?![a-z\\s])":"$1蒙","([^a-z\\s])mén(?![a-z\\s])":"$1门","([^a-z\\s])miè(?![a-z\\s])":"$1灭","([^a-z\\s])mí(?![a-z\\s])":"$1迷","([^a-z\\s])mì(?![a-z\\s])":"$1蜜","([^a-z\\s])mō(?![a-z\\s])":"$1摸","([^a-z\\s])nǎi(?![a-z\\s])":"$1奶","([^a-z\\s])nèn(?![a-z\\s])":"$1嫩","([^a-z\\s])niào(?![a-z\\s])":"$1尿","([^a-z\\s])niē(?![a-z\\s])":"$1捏","([^a-z\\s])nòng(?![a-z\\s])":"$1弄","([^a-z\\s])nǚ(?![a-z\\s])":"$1女","([^a-z\\s])pào(?![a-z\\s])":"$1炮","([^a-z\\s])piàn(?![a-z\\s])":"$1片","([^a-z\\s])qi[āa]ng(?![a-z\\s])":"$1枪","([^a-z\\s])qíng(?![a-z\\s])":"$1情","([^a-z\\s])qīn(?![a-z\\s])":"$1亲","([^a-z\\s])qiú(?![a-z\\s])":"$1求","([^a-z\\s])quán(?![a-z\\s])":"$1全","([^a-z\\s])rén(?![a-z\\s])":"$1人","([^a-z\\s])rì(?![a-z\\s])":"$1日","([^a-z\\s])rǔ(?![a-z\\s])":"$1乳","([^a-z\\s])sāo(?![a-z\\s])":"$1骚","([^a-z\\s])sǎo(?![a-z\\s])":"$1骚","([^a-z\\s])sè(?![a-z\\s])":"$1色","([^a-z\\s])shā(?![a-z\\s])":"$1杀","([^a-z\\s])shēn(?![a-z\\s])":"$1呻","([^a-z\\s])shén(?![a-z\\s])":"$1神","([^a-z\\s])shè(?![a-z\\s])":"$1射","([^a-z\\s])shǐ(?![a-z\\s])":"$1屎","([^a-z\\s])shì(?![a-z\\s])":"$1侍","([^a-z\\s])sǐ(?![a-z\\s])":"$1死","([^a-z\\s])sī(?![a-z\\s])":"$1私","([^a-z\\s])shǔn(?![a-z\\s])":"$1吮","([^a-z\\s])sǔn(?![a-z\\s])":"$1吮","([^a-z\\s])sū(?![a-z\\s])":"$1酥","([^a-z\\s])tān(?![a-z\\s])":"$1贪","([^a-z\\s])tiǎn(?![a-z\\s])":"$1舔","([^a-z\\s])tǐng(?![a-z\\s])":"$1挺","([^a-z\\s])tǐ(?![a-z\\s])":"$1体","([^a-z\\s])tǒng(?![a-z\\s])":"$1捅","([^a-z\\s])tōu(?![a-z\\s])":"$1偷","([^a-z\\s])tou(?![a-z\\s])":"$1偷","([^a-z\\s])tuǐ(?![a-z\\s])":"$1腿","([^a-z\\s])tūn(?![a-z\\s])":"$1吞","([^a-z\\s])tún(?![a-z\\s])":"$1臀","([^a-z\\s])tiáo(?![a-z\\s])":"$1调","([^a-z\\s])tài(?![a-z\\s])":"$1态","([^a-z\\s])wēn(?![a-z\\s])":"$1温","([^a-z\\s])wěn(?![a-z\\s])":"$1吻","([^a-z\\s])xiǎo(?![a-z\\s])":"$1小","([^a-z\\s])xìng(?![a-z\\s])":"$1性","([^a-z\\s])xiōng(?![a-z\\s])":"$1胸","([^a-z\\s])xī(?![a-z\\s])":"$1吸","([^a-z\\s])xí(?![a-z\\s])":"$1习","([^a-z\\s])xué(?![a-z\\s])":"$1穴","([^a-z\\s])xuè(?![a-z\\s])":"$1穴","([^a-z\\s])xùe(?![a-z\\s])":"$1穴","([^a-z\\s])xuan(?![a-z\\s])":"$1宣","([^a-z\\s])yāng(?![a-z\\s])":"$1央","([^a-z\\s])yàn(?![a-z\\s])":"$1艳","([^a-z\\s])yīn(?![a-z\\s])":"$1阴","([^a-z\\s])yào(?![a-z\\s])":"$1药","([^a-z\\s])yé(?![a-z\\s])":"$1爷","([^a-z\\s])yòu(?![a-z\\s])":"$1诱","([^a-z\\s])zàng(?![a-z\\s])":"$1脏","([^a-z\\s])yù(?![a-z\\s])":"$1欲","([^a-z\\s])yín(?![a-z\\s])":"$1淫","([^a-z\\s])zhēn(?![a-z\\s])":"$1针","([^a-z\\s])zēn(?![a-z\\s])":"$1针","([^a-z\\s])zhà(?![a-z\\s])":"$1炸","([^a-z\\s])zhèng(?![a-z\\s])":"$1政","([^a-z\\s])zǒu(?![a-z\\s])":"$1走","([^a-z\\s])zuì(?![a-z\\s])":"$1罪","([^a-z\\s])zuò(?![a-z\\s])":"$1做","([^a-z\\s])zhōng(?![a-z\\s])":"$1中","([^a-z\\s])ri(?![a-z\\s])":"$1日","([^a-z\\s])se(?![a-z\\s])":"$1色","([^a-z\\s])yu(?![a-z\\s])":"$1欲","([^a-z\\s])xing(?![a-z\\s])":"$1性","([^a-z\\s])jing(?![a-z\\s])":"$1精","([^a-z\\s])ting(?![a-z\\s])":"$1挺"})
}
//修复替换
function replaceOthers(text){
    return replace(text,{"碧欲": "碧玉", "美欲": "美玉","欲石": "玉石","惜欲": "惜玉","宝欲": "宝玉","品性": "品行", "德性": "德行","波ok": "book", "波SS": "BOSS","弥俩": "你俩","妳": "你","([大登水海空着内])6":"$1陆","6([续军战地路空海离运时行压家上])":"陆$1","6陆续续":"陆陆续续","6[她的]":"陆地","著6":"着陆","圞|垩|卝|龘":""})
}

var Filter = require("./Filter");
var globalReplace = {
    chapterTitle:function (text){
        return replace(text,Filter.chapterTitle);
    },
    chapterBeforeFilter:function (text){
        return replace(text,Filter.chapterBeforeFilter);
    },
    chapterAfterFilter:function (text){
        return replace(text,Filter.chapterAfterFilter);
    },
}

var mergeLine = require("./mergeLine");

module.exports.Integer = new Type(0,Integer);
module.exports.Float = new Type(0,Float);
module.exports.String = new Type('',_String);
module.exports.Boolean = new Type(false,Boolean);
module.exports.Time = new Type(+new Date,Time);
module.exports.Base64 = new Type('',Base64);
module.exports.IsEnd = new Type(false,IsEnd);
module.exports.Link = new Type('',Link);
module.exports.Uuid = module.exports.String(UUID);
module.exports.Id = module.exports.String(Id);
module.exports.HTMLdecode = module.exports.String(HTMLdecode);
module.exports.SimpleChinese = module.exports.String(SimpleChinese);
module.exports.TrimText = module.exports.String(TrimText);
module.exports.Image = module.exports.Base64(TrimText);
module.exports.filterTag = module.exports.String(filterTag);
//HTML解码>移除HTML标签>移除不合法的字符>去除首尾空格>转换为简体中文
module.exports.Path = module.exports.HTMLdecode(filterTag)(filterInvalidPathChar)(TrimText)(SimpleChinese);
module.exports.Text = module.exports.HTMLdecode(filterTag)(TrimText)(SimpleChinese);
//HTML解码>移除HTML标签>移除不合法的字符>去除首尾空格>转换为简体中文>自定义替换
module.exports.Title = module.exports.HTMLdecode(filterTag)(clearTitle)(globalReplace.chapterTitle)(filterInvalidPathChar)(TrimText)(SimpleChinese);
//修复web>HTML解码>屏蔽字还原>多字替换>双字替换>移除广告>移除HTML标签>
module.exports.Content = module.exports.String(webFormatFix)
(globalReplace.chapterBeforeFilter)
(HTMLdecode)
(fixMaskWords)
(fixMultiWords)
(fixDoubleWords)
(removeHTMLAD)
(filterTag)
(filterTitle)
(removeTextAD)
(oneWordReplace)
(replaceOthers)
(globalReplace.chapterAfterFilter)
(fixPunctuation)
(mergeLine)
(TrimText)
(SimpleChinese);


function Attributes(define){
    var data = {};
    if (!Array.isArray(define)) return data;
    define.forEach(item=>{
        data[item[0]] = new module.exports[item[1]](item[2]);
    });
    return data;
}
Attributes.prototype.set = function (k,v){
    var data = this.val();
    if (typeof k == 'object'){
        for (var x in k){
            this.set(x,k[x]);
        }
        return this;
    }
    if (k in data) data[k].val(v);
    return this;
}
Attributes.prototype.get = function (k){
    var data = this.val();
    if (k in data) return data[k].val();
    return null;
}

Attributes.prototype.empty = function (){
    var data = this.val();
    for (var x in data){
        o[x] = data[x].val('');
    }
    return this;
}

Attributes.prototype.valueOf = function (){
    var o = {};
    var data = this.val();
    for (var x in data){
        o[x] = data[x].val();
    }
    return o;
}

Attributes.prototype.toString = function (){
    return JSON.stringify(this.valueOf(),null,2);
}
module.exports.Attributes = new Type({},Attributes);
